# Задача 2. Напишите программу, которая принимает на вход
# координаты двух точек и находит расстояние между ними в 2D пространстве.
# A (3,6); B (2,1) -> 5,09 / A (7,-5); B (1,-1) -> 7,21

point_one = [int(i) for i in input(
    'Введите координаты первой точки через пробел: ').split()]
point_two = [int(i) for i in input(
    'Введите координаты второй точки через пробел: ').split()]

result = ((point_two[0] - point_one[0])**2 +
          (point_two[1] - point_one[1])**2)**0.5
result = round(result, 2)
print(result)